1.Create a .csv file with data given below and read it as dataframe - white,red,blue,green,animal

In [1]:
import pandas as pd 
df = pd.read_csv('animal.csv')
print(df)

   white  red  blue  green animal
0      1  5.0   2.0      3    cat
1      2  7.0   8.0      5    dog
2      3  NaN   6.0      7  horse
3      4  5.0   6.0      7   duck
4      9  NaN   NaN      6  mouse
5      9  8.0   7.0      6  mouse
6      9  8.0   7.0      6  mouse

In [2]:
#a
df['blue'].isna().sum()

1

In [3]:
df['blue'].fillna(df['blue'].median(), inplace=True)
print(df)

   white  red  blue  green animal
0      1  5.0   2.0      3    cat
1      2  7.0   8.0      5    dog
2      3  NaN   6.0      7  horse
3      4  5.0   6.0      7   duck
4      9  NaN   6.5      6  mouse
5      9  8.0   7.0      6  mouse
6      9  8.0   7.0      6  mouse

In [4]:
#b
group = df['blue'].groupby(df['animal'])
group.mean()

animal
cat      2.000000
dog      8.000000
duck     6.000000
horse    6.000000
mouse    6.833333
Name: blue, dtype: float64

In [5]:
#c
group2 = df.groupby('animal').sum()
print(group2)

        white   red  blue  green
animal
cat         1   5.0   2.0      3
dog         2   7.0   8.0      5
duck        4   5.0   6.0      7
horse       3   0.0   6.0      7
mouse      27  16.0  20.5     18

In [6]:
#d
group3 = df.groupby(['animal','green']).sum()
print(group3)

              white   red  blue
animal green
cat    3          1   5.0   2.0
dog    5          2   7.0   8.0
duck   7          4   5.0   6.0
horse  7          3   0.0   6.0
mouse  6         27  16.0  20.5

2.Create a list with 20 different numerical values and divide it as 4 groups namely poor, satisfactory, good and excellent. 
Display values with their group names.

In [7]:
import pandas as pd
lists=[33, 34, 23, 61, 58, 89, 69, 90, 56, 51,
       54, 4, 92, 17, 80, 8, 14, 83, 45, 84]
lists

df6=pd.DataFrame({'performance':['excellent','good','satisfactory','poor'],
                  'values':[[4,8,14,17,23],[33,34,45],[51,56,58,61,69],
                                    [80,83,84,89,90,92]]})
df6

    performance                    values
0     excellent        [4, 8, 14, 17, 23]
1          good              [33, 34, 45]
2  satisfactory      [51, 56, 58, 61, 69]
3          poor  [80, 83, 84, 89, 90, 92]

3. For the given DataFrame df, write a python statement to sort the DataFrame in the descending order of points:house	year	points

In [8]:
df2={'house':['raman','tagore','Ashok','raman','tagore'],
     'year':[2010,2011,2009,2010,2011],'points':[500,600,300,400,550]}
data=pd.DataFrame(df2,columns=['house','year','points'])
data

    house  year  points
0   raman  2010     500
1  tagore  2011     600
2   Ashok  2009     300
3   raman  2010     400
4  tagore  2011     550

In [9]:
data.sort_values(by="points",ascending=False)

    house  year  points
1  tagore  2011     600
4  tagore  2011     550
0   raman  2010     500
3   raman  2010     400
2   Ashok  2009     300

4.Write a program to calculate covariance for the given datasets for the number of items purchased with their unit price as under
Unit price=[10,20,50,80,100]
No_items=[30,45,40,20,40]

In [10]:
import math
def mean(arr, n): 
    sum = 0
    for i in range(0, n):
        sum = sum + arr[i]
    return sum / n 
def covariance(arr1, arr2, n):
 
    sum = 0
    mean_arr1 = mean(arr1, n)
    mean_arr2 = mean(arr2, n)
    for i in range(0, n):
        sum = (sum + (arr1[i] - mean_arr1) * (arr2[i] - mean_arr2))
 
    return sum / (n - 1)
Unit_price=[10,20,50,80,100]
n=len(Unit_price)
No_items=[30,45,40,20,40]
m=len(No_items)
if (m == n):
    print(covariance(Unit_price, No_items, m))

-75.0

5.For the given DataFrame df1, df2, write python program
              id	color	brand

In [11]:
df1=pd.DataFrame({'id':['ball','pencil','pen','mug','ashtray'],
                  'color':['white','red','red','black','green'],
                  'brand':['OMG','ABC','ABC','POD','POD']})
df2=pd.DataFrame({'id':['pencil','pencil','ball','pen'],
                  'brand':['OMG','POD','ABC','POD']})
#a
pd.merge(df1,df2)

Empty DataFrame
Columns: [id, color, brand]
Index: []

In [12]:
#b
pd.concat([df1,df2])

        id  color brand
0     ball  white   OMG
1   pencil    red   ABC
2      pen    red   ABC
3      mug  black   POD
4  ashtray  green   POD
0   pencil    NaN   OMG
1   pencil    NaN   POD
2     ball    NaN   ABC
3      pen    NaN   POD

In [13]:
#c
df2.columns = ['brand2','id2']
df1.join(df2)

        id  color brand  brand2  id2
0     ball  white   OMG  pencil  OMG
1   pencil    red   ABC  pencil  POD
2      pen    red   ABC    ball  ABC
3      mug  black   POD     pen  POD
4  ashtray  green   POD     NaN  NaN

In [14]:
#d
df1.combine_first(df2)

  brand  brand2  color       id  id2
0   OMG  pencil  white     ball  OMG
1   ABC  pencil    red   pencil  POD
2   ABC    ball    red      pen  ABC
3   POD     pen  black      mug  POD
4   POD     NaN  green  ashtray  NaN

In [15]:
#e
df2.combine_first(df1)

  brand  brand2  color       id  id2
0   OMG  pencil  white     ball  OMG
1   ABC  pencil    red   pencil  POD
2   ABC    ball    red      pen  ABC
3   POD     pen  black      mug  POD
4   POD     NaN  green  ashtray  NaN

6.Write a program to split for the given dataset into groups and display target columns as a list of unique values.(split,apply,combine)

In [16]:
df3=pd.DataFrame({'color':['White','Black','white','white','black','black'],
                  'status':['Up','Up','Down','Down','Down','up'],
                  'Value1':[12.33,14.35,22.34,27.84,23.40,18.33],
                  'Value2':[11.23,31.80,29.99,31.18,18.25,22.44]})
new_df = df3[['color', 'status', 'Value1','Value2']].drop_duplicates()\
                         .groupby(['color','status'])['Value1']\
                         .apply(list)\
                         .reset_index()
new_df['Value1'] = new_df.apply(lambda x: (','.join([str(s) for s in 
                                                     x['Value1']])), axis = 1)
print(new_df)

   color status       Value1
0  Black     Up        14.35
1  White     Up        12.33
2  black   Down         23.4
3  black     up        18.33
4  white   Down  22.34,27.84

7.For the given DataFrame df, write a python program

In [17]:
df=pd.DataFrame({'color':['white','red','green','red','green'],
                 'object':['Pen','pencil','Pencil','ashtray','pen'],
                 'price1':[5.56,4.20,1.30,0.56,2.75],
                 'price2':[4.75,4.12,1.60,0.75,3.15]})
#a
group = df['price1'].groupby(df['color'])

In [18]:
#b
group.mean()

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [19]:
#c
grp = df['price1'].groupby([df['color'],df['object']])
grp.groups

{('green', 'Pencil'): [2], ('green', 'pen'): [4], ('red', 'ashtray'): [3], ('red', 'pencil'): [1], ('white', 'Pen'): [0]}

8. Write python code for given data set Convert to wide frame
   color          item           value

In [20]:
import numpy as np
df4=pd.DataFrame({'color':['white','white','white','red','red',
                           'red','black','black','black'],
                 'item':['ball','pen','mug','ball','pen','mug',
                         'ball','pen','mug'],
                  'value':[0.091438,0.495049,0.956225,0.394441,
                           0.501164,0.561832,0.879022,0.610975,0.093324]})
df5=df4.pivot(index='color', columns='item', values='value')
df5

item       ball       mug       pen
color
black  0.879022  0.093324  0.610975
red    0.394441  0.561832  0.501164
white  0.091438  0.956225  0.495049